# IsLocked Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..IsLocked Property
Dimension Class See Also
---
Indicates if this dimension is locked.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsLocked { get; set; }
```

Visual Basic
---
```text
Public Property IsLocked As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsLocked {
	bool get ();
	void set (bool value);
}
```

# Remarks
This property always returns false if the dimension is a radial or spot dimension. This property cannot be set if the dimension has been labeled, or if the dimension shape is arc-length, radial, diameter or spot, or if the dimension is linear with more than one segment.
# See Also
Dimension Class
Autodesk.Revit.DB Namespace